IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC1_CFG_CONTROLSS_ADC1_CFG.xml
	<register id="CONTROLSS_ADC1_CFG_ADCSOCFRC1" acronym="CONTROLSS_ADC1_CFG_ADCSOCFRC1" offset="0x1A" width="16" description="">
		<bitfield id="SOC15" width="1" begin="15" end="15" resetval="0x0" description="SOC15 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC15 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC15 flag bit to 1. This will cause a conversion to start once priority is given to SOC15.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC15 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC14" width="1" begin="14" end="14" resetval="0x0" description="SOC14 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC14 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC14 flag bit to 1. This will cause a conversion to start once priority is given to SOC14.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC14 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="14" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC13" width="1" begin="13" end="13" resetval="0x0" description="SOC13 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC13 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC13 flag bit to 1. This will cause a conversion to start once priority is given to SOC13.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC13 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="13" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC12" width="1" begin="12" end="12" resetval="0x0" description="SOC12 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC12 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC12 flag bit to 1. This will cause a conversion to start once priority is given to SOC12.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC12 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC11" width="1" begin="11" end="11" resetval="0x0" description="SOC11 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC11 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC11 flag bit to 1. This will cause a conversion to start once priority is given to SOC11.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC11 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC10" width="1" begin="10" end="10" resetval="0x0" description="SOC10 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC10 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC10 flag bit to 1. This will cause a conversion to start once priority is given to SOC10.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC10 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC9" width="1" begin="9" end="9" resetval="0x0" description="SOC9 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC9 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC9 flag bit to 1. This will cause a conversion to start once priority is given to SOC9.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC9 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC8" width="1" begin="8" end="8" resetval="0x0" description="SOC8 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC8 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC8 flag bit to 1. This will cause a conversion to start once priority is given to SOC8.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC8 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC7" width="1" begin="7" end="7" resetval="0x0" description="SOC7 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC7 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC7 flag bit to 1. This will cause a conversion to start once priority is given to SOC7.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC7 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC6" width="1" begin="6" end="6" resetval="0x0" description="SOC6 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC6 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC6 flag bit to 1. This will cause a conversion to start once priority is given to SOC6.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC6 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC5" width="1" begin="5" end="5" resetval="0x0" description="SOC5 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC5 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC5 flag bit to 1. This will cause a conversion to start once priority is given to SOC5.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC5 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC4" width="1" begin="4" end="4" resetval="0x0" description="SOC4 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC4 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC4 flag bit to 1. This will cause a conversion to start once priority is given to SOC4.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC4 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC3" width="1" begin="3" end="3" resetval="0x0" description="SOC3 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC3 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC3 flag bit to 1. This will cause a conversion to start once priority is given to SOC3.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC3 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC2" width="1" begin="2" end="2" resetval="0x0" description="SOC2 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC2 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC2 flag bit to 1. This will cause a conversion to start once priority is given to SOC2.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC2 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC1" width="1" begin="1" end="1" resetval="0x0" description="SOC1 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC1 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC1 flag bit to 1. This will cause a conversion to start once priority is given to SOC1.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC1 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC0" width="1" begin="0" end="0" resetval="0x0" description="SOC0 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC0 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0.    0  No action.   1  Force SOC0 flag bit to 1. This will cause a conversion to start once priority is given to SOC0.  If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC0 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
