IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC1_CFG_CONTROLSS_ADC1_CFG.xml
	<register id="CONTROLSS_ADC1_CFG_ADCSOC0CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC0CTL" offset="0x20" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC0 Trigger Source Select. Along with the SOC0 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC0 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC0 Channel Select. Selects the channel to be converted when SOC0 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC0 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC1CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC1CTL" offset="0x24" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC1 Trigger Source Select. Along with the SOC1 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC1 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC1 Channel Select. Selects the channel to be converted when SOC1 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC1 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC2CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC2CTL" offset="0x28" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC2 Trigger Source Select. Along with the SOC2 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC2 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC2 Channel Select. Selects the channel to be converted when SOC2 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC2 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC3CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC3CTL" offset="0x2C" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC3 Trigger Source Select. Along with the SOC3 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC3 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC3 Channel Select. Selects the channel to be converted when SOC3 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC3 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC4CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC4CTL" offset="0x30" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC4 Trigger Source Select. Along with the SOC4 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC4 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC4 Channel Select. Selects the channel to be converted when SOC4 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC4 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC5CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC5CTL" offset="0x34" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC5 Trigger Source Select. Along with the SOC5 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC5 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC5 Channel Select. Selects the channel to be converted when SOC5 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC5 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC6CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC6CTL" offset="0x38" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC6 Trigger Source Select. Along with the SOC6 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC6 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC6 Channel Select. Selects the channel to be converted when SOC6 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC6 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCSOC7CTL" acronym="CONTROLSS_ADC1_CFG_ADCSOC7CTL" offset="0x3C" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC7 Trigger Source Select. Along with the SOC7 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC7 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC7 Channel Select. Selects the channel to be converted when SOC7 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC7 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
