IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC1_CFG_CONTROLSS_ADC1_CFG.xml
	<register id="CONTROLSS_ADC1_CFG_ADCEVTINTSEL" acronym="CONTROLSS_ADC1_CFG_ADCEVTINTSEL" offset="0x6C" width="16" description="">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="14" rwaccess="RW"/> 
		<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="13" rwaccess="RW"/> 
		<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="12" rwaccess="RW"/> 
		<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="10" rwaccess="RW"/> 
		<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="9" rwaccess="RW"/> 
		<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="8" rwaccess="RW"/> 
		<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="6" rwaccess="RW"/> 
		<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="5" rwaccess="RW"/> 
		<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="4" rwaccess="RW"/> 
		<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="2" rwaccess="RW"/> 
		<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="1" rwaccess="RW"/> 
		<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCOSDETECT" acronym="CONTROLSS_ADC1_CFG_ADCOSDETECT" offset="0x70" width="16" description="">
		<bitfield id="DETECTCFG" width="3" begin="2" end="0" resetval="0x0" description="ADC Opens and Shorts Detect Configuration. This bit field defines the open/shorts detection circuit state.    0h  Open/Shorts detection circuit is disabled.   1h  Open/Shorts detection circuit is enabled at zero scale.   2h  Open/Shorts detection circuit is enabled at full scale.   3h  Open/Shorts detection circuit is enabled at (nominal) 5/12 scale.   4h  Open/Shorts detection circuit is enabled at (nominal) 7/12 scale.   5h  Open/Shorts detection circuit is enabled with a (nominal) 5K pulldown to VSSA.   6h  Open/Shorts detection circuit is enabled with a (nominal) 5K pullup to VDDA.   7h  Open/Shorts detection circuit is enabled with a (nominal) 7K pulldown to VSSA." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCCOUNTER" acronym="CONTROLSS_ADC1_CFG_ADCCOUNTER" offset="0x72" width="16" description="">
		<bitfield id="FREECOUNT" width="12" begin="11" end="0" resetval="0x0" description="ADC Free Running Counter Value. This bit field reflects the status of the free running ADC counter." range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC1_CFG_ADCREV" acronym="CONTROLSS_ADC1_CFG_ADCREV" offset="0x74" width="16" description="">
		<bitfield id="REV" width="8" begin="15" end="8" resetval="0x1" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as 00h." range="15 - 8" rwaccess="RO"/> 
		<bitfield id="TYPE" width="8" begin="7" end="0" resetval="0x5" description="ADC Type. Always set to 5 for this ADC." range="7 - 0" rwaccess="RO"/>
	</register>
